20241211T011547--kdoc-323-ノベルゲームバンドルを作る__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-04T00:40:51Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 323: ノベルゲームバンドルを作る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 323: ノベルゲームバンドルを作る</h1>
<div id="outline-container-org8b1edf8" class="outline-2">
<h2 id="org8b1edf8"><a href="#org8b1edf8">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org8b1edf8">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-12-15 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-01-26 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6cbc7bf" class="outline-2">
<h2 id="org6cbc7bf"><a href="#org6cbc7bf"><span class="done DONE">DONE</span> プロジェクトのステータス</a></h2>
<div class="outline-text-2" id="text-org6cbc7bf">
<p>
プロジェクトは完了した。
</p>
</div>
</div>
<div id="outline-container-org5354938" class="outline-2">
<h2 id="org5354938"><a href="#org5354938">概要</a></h2>
<div class="outline-text-2" id="text-org5354938">
<p>
著作権の問題のない文章を、ノベルゲーム風にして名文を手軽に読めるようにする。
</p>
</div>
</div>
<div id="outline-container-org71558f0" class="outline-2">
<h2 id="org71558f0"><a href="#org71558f0">なぜ作ったか</a></h2>
<div class="outline-text-2" id="text-org71558f0">
<p>
なぜ作ったか。
</p>

<ul class="org-ul">
<li>青空文庫などで、歴史的文学がただで大量に公開されている。しかし、それらがじゅうぶんに活用されているとはいえない。その面白さや奥深さに比して、読んだことのあるものは少ない。読もうと考えた機会はあったものの、すべて読み通せたものは多くない。個人的にもそうだし、体感的に、そもそも存在を知らない人も多い</li>
<li>著作権の切れた本はAmazon Kindleなどでも無料で販売されていて、端末にダウンロードはしていた。しかし読む気になれず、ずっと未読のままで眠っている</li>
</ul>

<p>
原因は、われわれがおかれた環境にあるように見える。娯楽は即効性を求めるようになっている。無限にあるコンテンツのなかで視聴にたるかどうかは、最初の数十秒〜数十分で判断する。本の世界を認識するための叙述…のどかな時代特有の長々とした序盤…を読み終える前に脱落することが多い。名作であるもののなかには、序盤が退屈に感じたり世界に入りこむのが大変なものもある。
</p>

<p>
そこで、ノベルゲームの表示スタイルで再生できるようにした。
</p>

<ul class="org-ul">
<li>少しづつ文字が表示されるので圧倒されない</li>
<li>リズムがつきやすい</li>
<li>背景によって、場面のイメージがつきやすい</li>
</ul>

<p>
また、別の方向性として、明治〜昭和の時代背景であったり地理(特に東京)は、読むうえで必要な前提知識となっている。さらに、書いた人物の実在を感じる情報…住んだ家や生い立ち、家族構成、専門領域、好物…を知っているほど読みやすくなる。そのあたりを得るためのヒントを提供できればよいと考えている。
</p>
</div>
</div>
<div id="outline-container-orgfd6a30a" class="outline-2">
<h2 id="orgfd6a30a"><a href="#orgfd6a30a">仕様の方針</a></h2>
<div class="outline-text-2" id="text-orgfd6a30a">
<ul class="org-ul">
<li>ノベルゲームエンジンの仕様に関する知見は持っていない。すでにデファクトとなっているエンジンやゲームの仕様を参考にし、仕様ぎめの労力をなくした</li>
<li>ノベルゲームにありがちな、音楽/立ち絵/エフェクトといった機能は搭載しない。単純にそれらのメディアを作るリソースがない</li>
<li>ただで配布するものなので、コストは極力かけない。作業者は自分しかいないので、テキストや背景の加工を極力自動でできるようにする</li>
<li>気軽に試せるように、ブラウザで実行できること</li>
<li>開発の勉強になること。読むことだけ考えれば、既存のノベルゲームエンジンに載せるのが一番はやい。しかしそれだと開発の勉強にならない。勉強の観点からいって、最低限の機能をもったライブラリを使うのが望ましい</li>
<li>とりあえずたいした状態保持は必要ない。ローカルストレージやファイルで保持する</li>
</ul>
</div>
</div>
<div id="outline-container-orgee65f9e" class="outline-2">
<h2 id="orgee65f9e"><a href="#orgee65f9e">段階</a></h2>
<div class="outline-text-2" id="text-orgee65f9e">
<ul class="org-ul">
<li>メモ化のためどうせ変数に入れるのだから、UI用の画像類はまとめて読み込んでいたほうがよい</li>
<li>セーブ機能
<ul class="org-ul">
<li>タイトルとチャプター</li>
</ul></li>
<li>既読機能</li>
<li>実績機能</li>
<li>自動文字送り機能</li>
<li>直前の文字表示機能</li>
<li>リリース</li>
</ul>
</div>
</div>
<div id="outline-container-org820494e" class="outline-2">
<h2 id="org820494e"><a href="#org820494e">Tasks</a></h2>
<div class="outline-text-2" id="text-org820494e">
</div>
<div id="outline-container-org711af8a" class="outline-3">
<h3 id="org711af8a"><a href="#org711af8a"><span class="todo TODO">TODO</span> シナリオを100個集める</a></h3>
<div class="outline-text-3" id="text-org711af8a">
<p>
地道に収集する。
</p>
</div>
</div>
<div id="outline-container-orgf46ccdc" class="outline-3">
<h3 id="orgf46ccdc"><a href="#orgf46ccdc"><span class="todo TODO">TODO</span> UIをリファクタ</a></h3>
<div class="outline-text-3" id="text-orgf46ccdc">
<p>
ボタンなどはそういう関数に、各自で指定してる色は変数にまとめる。
</p>
</div>
</div>
<div id="outline-container-org34a9d89" class="outline-3">
<h3 id="org34a9d89"><a href="#org34a9d89"><span class="todo TODO">TODO</span> startラベルの先頭が常に実行される</a></h3>
<div class="outline-text-3" id="text-org34a9d89">
<div class="org-src-container">
<pre class="src src-nil">*start
[image source="black.png"]
『こころ』夏目漱石
</pre>
</div>

<p>
ほかのラベルに飛んでも、黒画像の設定が実行される。もし文字を入れると、それが実行される。
</p>
</div>
</div>
<div id="outline-container-org126e73d" class="outline-3">
<h3 id="org126e73d"><a href="#org126e73d"><span class="todo TODO">TODO</span> シナリオジャンプごとに背景をリセットする</a></h3>
<div class="outline-text-3" id="text-org126e73d">
<p>
今は残り続ける。よくないことが多い。
</p>

<p>
チャプタージャンプ時にイベント通知すればよさそうか。
</p>
</div>
</div>
<div id="outline-container-org5fcd001" class="outline-3">
<h3 id="org5fcd001"><a href="#org5fcd001"><span class="todo TODO">TODO</span> フェードアウト/イン</a></h3>
<div class="outline-text-3" id="text-org5fcd001">
<p>
背景画像を変えるとき、パッと変わって見苦しい。場面転換のときは黒にフェードアウトするとかしたい。
</p>
</div>
</div>
</div>
<div id="outline-container-orgf3a7f13" class="outline-2">
<h2 id="orgf3a7f13"><a href="#orgf3a7f13">Archives</a></h2>
<div class="outline-text-2" id="text-orgf3a7f13">
</div>
<div id="outline-container-orgce6f7b1" class="outline-3">
<h3 id="orgce6f7b1"><a href="#orgce6f7b1"><span class="done DONE">DONE</span> セーブ機能</a></h3>
<div class="outline-text-3" id="text-orgce6f7b1">
<p>
セーブできるようにする。まずはオンメモリでやって、次に永続化・ロードできるようにする。
</p>

<ul class="org-ul">
<li>シナリオに1つでいいだろう</li>
<li>トップメニュー
<ul class="org-ul">
<li>こころ ch4 位置45</li>
<li>明暗 ch5 位置23</li>
</ul></li>
<li>クリックすると、「読込」「削除」ができる</li>
<li>ポーズ画面では保存ができる。スロットに保存ずみの情報が表示され、保存されたことが確認できる</li>
<li>あとでファイル化しやすい形でないといけない</li>
</ul>
</div>
</div>
<div id="outline-container-orgd43078e" class="outline-3">
<h3 id="orgd43078e"><a href="#orgd43078e"><span class="done DONE">DONE</span> 収録冊数を表示する</a></h3>
<div class="outline-text-3" id="text-orgd43078e">
<p>
表示してわかるようにする。
</p>
</div>
</div>
<div id="outline-container-org1856fb9" class="outline-3">
<h3 id="org1856fb9"><a href="#org1856fb9"><span class="done DONE">DONE</span> 既読機能</a></h3>
<div class="outline-text-3" id="text-org1856fb9">
<p>
既読チェックを付けられるようにする。
</p>
</div>
</div>
<div id="outline-container-org21cc0e9" class="outline-3">
<h3 id="org21cc0e9"><a href="#org21cc0e9"><span class="done DONE">DONE</span> 作品を読む</a></h3>
<div class="outline-text-3" id="text-org21cc0e9">
<p>
ひたすら読んで微調整する。
</p>
</div>
</div>
</div>
<div id="outline-container-orged41b73" class="outline-2">
<h2 id="orged41b73"><a href="#orged41b73">関連</a></h2>
<div class="outline-text-2" id="text-orged41b73">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
